app/Controllers/GedungCont.php

DELETE FROM `gedung`
WHERE `id_gedung` = '133'
---
    public function delete($id_gedung)
    {
     $this->gedungModel->where('id_gedung', $id_gedung)->delete();