app/Models/gedungModel.php

    public function getGedung($id_gedung = false){
        if($id_gedung == false){
            return $this->findAll();
        }

        return $this->where(['id_gedung' => $id_gedung])->first();
---
SELECT *
FROM `gedung`
SELECT *
FROM `gedung`
WHERE `id_gedung` = '133'
 LIMIT 1